In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [4]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
9 rows affected.

[('company',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('rohi_proj',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [9]:
%%sql
use company
select*from

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'select*from' at line 2
[SQL: use company
select*from]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [14]:
%%sql
select*from Tables_in_company

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'company.tables_in_company' doesn't exist
[SQL: select*from Tables_in_company]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [15]:
%%sql
create database uber_det;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [18]:
%%sql
use uber_det;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [25]:
%%sql
create table rides (
    ride_id int,
    driver_id int,
    rider_id int,
    pickup varchar(100),
    drop_loc varchar(100),
    ride_date datetime,
    fare decimal(10,2) #i made an error i have put an comma , so last value doesn't need comma
);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'rides' already exists
[SQL: create table rides (
    ride_id int,
    driver_id int,
    rider_id int,
    pickup varchar(100),
    drop_loc varchar(100),
    ride_date datetime,
    fare decimal(10,2) #i made an error i have put an comma , so last value doesn't need comma
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [28]:
%%sql
insert into rides (ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(1,1002,2001,'ambatur','t.nagr','2025-07-23 21:00:00',102.34),
(2,1003,2002,'alanthur','theynapet','2025-07-24 01:00:00',102.00),
(3,1004,2003,'avadi','saithapet','2025-07-25 12:00:00',10.34),
(4,1005,2004,'adayar','kk nagr','2025-07-26 08:00:00',1020.34),
(5,1006,2005,'porur','west mango','2025-07-27 10:00:00',102.00);

    #here i have made error such as datetime dtype is character so use quotes and don't forget the commas in between values declaration

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[]

In [ ]:
 %%sql
select*from uber_det.rides;

In [35]:

%%sql
select * from rides where fare>'102';

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 1002, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34')),
 (4, 1005, 2004, 'adayar', 'kk nagr', datetime.datetime(2025, 7, 26, 8, 0), Decimal('1020.34'))]

In [37]:
%%sql
select * from rides where fare>'10' order by fare ;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(3, 1004, 2003, 'avadi', 'saithapet', datetime.datetime(2025, 7, 25, 12, 0), Decimal('10.34')),
 (2, 1003, 2002, 'alanthur', 'theynapet', datetime.datetime(2025, 7, 24, 1, 0), Decimal('102.00')),
 (5, 1006, 2005, 'porur', 'west mango', datetime.datetime(2025, 7, 27, 10, 0), Decimal('102.00')),
 (1, 1002, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34')),
 (4, 1005, 2004, 'adayar', 'kk nagr', datetime.datetime(2025, 7, 26, 8, 0), Decimal('1020.34'))]

In [38]:
%%sql
select*from rides where fare>'10' order by fare desc;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(4, 1005, 2004, 'adayar', 'kk nagr', datetime.datetime(2025, 7, 26, 8, 0), Decimal('1020.34')),
 (1, 1002, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34')),
 (2, 1003, 2002, 'alanthur', 'theynapet', datetime.datetime(2025, 7, 24, 1, 0), Decimal('102.00')),
 (5, 1006, 2005, 'porur', 'west mango', datetime.datetime(2025, 7, 27, 10, 0), Decimal('102.00')),
 (3, 1004, 2003, 'avadi', 'saithapet', datetime.datetime(2025, 7, 25, 12, 0), Decimal('10.34'))]

In [41]:
%%sql
select*from rides
where
fare>'500' and pickup='kk nagr';

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [51]:
%%sql
update rides set pickup='ambatur' where ride_id= '5';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [52]:
%%sql
select*from rides;

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 1002, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34')),
 (2, 1003, 2002, 'alanthur', 'theynapet', datetime.datetime(2025, 7, 24, 1, 0), Decimal('102.00')),
 (3, 1004, 2003, 'avadi', 'saithapet', datetime.datetime(2025, 7, 25, 12, 0), Decimal('10.34')),
 (4, 1005, 2004, 'adayar', 'kk nagr', datetime.datetime(2025, 7, 26, 8, 0), Decimal('1020.34')),
 (5, 1006, 2005, 'ambatur', 'west mango', datetime.datetime(2025, 7, 27, 10, 0), Decimal('102.00'))]

In [55]:
%%sql
select*from rides
where
fare>'10' and pickup='ambatur' order by ride_id desc;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(5, 1006, 2005, 'ambatur', 'west mango', datetime.datetime(2025, 7, 27, 10, 0), Decimal('102.00')),
 (1, 1002, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34'))]

In [58]:
%%sql
drop table rides;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [59]:
%%sql
create table rides1 (
    ride_id int primary key,
    driver_id int not null,
    rider_id int not null,
    pickup varchar(100) not null,
    drop_loc varchar(100)not null,
    ride_date datetime not null,
    fare decimal(10,2) not null
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [62]:
%%sql
insert into uber_det.rides1(ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(1,108,201,'royapet','porur','2025-10-23 04:19:21', 120.12)

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'rides1.PRIMARY'
[SQL: insert into uber_det.rides1(ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(1,108,201,'royapet','porur','2025-10-23 04:19:21', 120.12)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [63]:
%%sql
drop table rides1;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [64]:
%%sql
create table rides1 (
    ride_id int ,
    driver_id int not null,
    rider_id int not null,
    pickup varchar(100) not null,
    drop_loc varchar(100)not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    primary key (ride_id ,rider_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [68]:
%%sql
insert into rides1(ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(1,101,201,'ana','sjiw','2025-10-23 04:19:21', 120.12),
(1,101,202,'ana','sjiw','2025-10-23 04:19:21', 120.12);

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [69]:
%%sql
select*from rides1;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 101, 201, 'ana', 'sjiw', datetime.datetime(2025, 10, 23, 4, 19, 21), Decimal('120.12')),
 (1, 101, 202, 'ana', 'sjiw', datetime.datetime(2025, 10, 23, 4, 19, 21), Decimal('120.12'))]

In [70]:
%%sql
create table uber_det.user(
    user_id int primary key,
    email varchar(100) unique key
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [71]:
%%sql
insert into user(user_id,email)
values
(1,'abc@gmail.com'),
(2,'bbc@gmail.com'),
(3,null),
(null, 'beastt@gmail.com'),
(4,'abc@gmail.com');

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'user_id' cannot be null
[SQL: insert into user(user_id,email)
values
(1,'abc@gmail.com'),
(2,'bbc@gmail.com'),
(3,null),
(null, 'beastt@gmail.com'),
(4,'abc@gmail.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [73]:
%%sql
insert into user(user_id,email)
values
(1,'abc@gmail.com'),
(2,'bbc@gmail.com'),
(3,null);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [74]:
%%sql
select*from user;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(3, None), (1, 'abc@gmail.com'), (2, 'bbc@gmail.com')]

In [95]:
%%sql
drop table if exists ride2;
drop table if exists drivers;

create table drivers(
    driver_id int primary key,
    driver_name varchar(100),
    liscense_no varchar(100)
);

create table ride2(
    ride_id int ,
    driver_id int not null,
    rider_id int not null,
    pickup varchar(100) not null,
    drop_loc varchar(100)not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    foreign key(driver_id) references drivers(driver_id) on delete cascade
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [87]:
 %%sql
desc ride2;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'YES', '', None, ''),
 ('driver_id', 'int', 'NO', 'MUL', None, ''),
 ('rider_id', 'int', 'NO', '', None, ''),
 ('pickup', 'varchar(100)', 'NO', '', None, ''),
 ('drop_loc', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [88]:
%%sql
insert into drivers(driver_id,driver_name,liscense_no)
values
(1,'rajesh','jyvf87786'),
(2,'kavi','rnii12333');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [89]:
%%sql
insert into ride2(ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(101,1,2001,'ambatur','t.nagr','2025-07-23 21:00:00',102.34),
(102,2,2002,'alanthur','theynapet','2025-07-24 01:00:00',102.00);

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [91]:
%%sql
delete from drivers where driver_id='1';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [93]:
%%sql
select*from drivers;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(2, 'kavi', 'rnii12333')]

In [94]:
%%sql
select*from ride2;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(102, 2, 2002, 'alanthur', 'theynapet', datetime.datetime(2025, 7, 24, 1, 0), Decimal('102.00'))]

In [96]:
%%sql
drop table if exists ride2;
drop table if exists drivers;

create table drivers(
    driver_id int primary key,
    driver_name varchar(100),
    liscense_no varchar(100)
);

create table ride2(
    ride_id int ,
    driver_id int not null,
    rider_id int not null,
    pickup varchar(100) not null,
    drop_loc varchar(100)not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    foreign key(driver_id) references drivers(driver_id) 
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [97]:
%%sql
insert into drivers(driver_id,driver_name,liscense_no)
values
(1,'rajesh','jyvf87786'),
(2,'kavi','rnii12333');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [98]:
%%sql
insert into ride2(ride_id,driver_id,rider_id,pickup,drop_loc,ride_date,fare)
values
(101,1,2001,'ambatur','t.nagr','2025-07-23 21:00:00',102.34),
(102,2,2002,'alanthur','theynapet','2025-07-24 01:00:00',102.00);

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [100]:
%%sql
alter table ride2 add is_delete boolean default false;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [101]:
%%sql
update ride2 set is_delete = true where driver_id =2;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [102]:
%%sql
select*from ride2;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(101, 1, 2001, 'ambatur', 't.nagr', datetime.datetime(2025, 7, 23, 21, 0), Decimal('102.34'), 0),
 (102, 2, 2002, 'alanthur', 'theynapet', datetime.datetime(2025, 7, 24, 1, 0), Decimal('102.00'), 1)]